# MEPSupportUtils Class

---
General utility methods for the Autodesk Revit MEP Supporting components.
SystemObject Autodesk.Revit.DBMEPSupportUtils
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class MEPSupportUtils

    Public NotInheritable Class MEPSupportUtils

    public ref class MEPSupportUtils abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type MEPSupportUtils = class end
The MEPSupportUtils type exposes the following members.
| Name| Description
---|---|---
| CreateDuctworkStiffener|  Create family based stiffener on the specified fabrication ductwork.
Top
#### Reference
Autodesk.Revit.DB Namespace